import React, { Component } from 'react';
import './styles.css';

class About extends Component {
  render() {
    const delivery = [
      {
        title: 'Доставка',
        text: 'text 1'
      },
      {
        title: 'Оплата',
        text: 'text 2'
      }
    ];
    const baitTypes = [
      {
        image: 'https://static.pexels.com/photos/192454/pexels-photo-192454.jpeg',
        type: 'Коливалка на форель',
        text: 'Форель мабудь сама непередбачувана риба, її смаки наперед важко вгадати, тому єдиний провірений варіант - це часта зміна приманок. Цей прийом працює по різній рибі, але при ловлі форелі він безперечно самий дієвий. В умовах ловлі Прикарпаття і в самих Карпатах, де “стрімкі потоки-ріки”, важливо щоб коливалка гарно тримала течію, це чи не основна вимога. Другий важливий момент - це колір! Часто провірені моделі не дають результату, але при зміні самих тільки кольорів одна з них “вистрілює”. Перевагу в кольорах риба віддає по великому рахунку відносно погоди і прозорості води. Вага теж має значення. В основному використовуються приманки вагою 1-4г. Легкі моделі використовуються на маленьких, мілких потічках і струмках, для більших річок відповідно - раціональніше використання важчих коливалок. Все залежить від конкретних умов в даний момент. На одній річці часто бувають як обширні мілководні участки, так і ями в кілька метрів, бурні перекати, тому багатий асортимент буде не зайвим.'
      },
      {
        image: 'https://static.pexels.com/photos/294674/pexels-photo-294674.jpeg',
        type: 'Коливалка на окуня',
        text: 'Так як окунь риба “всюдисуща”, водиться і в річках, і в озерах, глибоких і мілководних, відносно чистих, так і у водоймах з обільною рослинністю. Від цього і варто відштовхуватися обираючи модель коливалки. Для течії бажано обирати коливалку прогонисту, з стабільною грою, щоб активно працювала і не входила в штопор. Окунь таку приманку легко наздоганяє і атакує. У спокійних водоймах або зовсім без течії більш раціонально буде використання коливалочок з вираженою і розмашистою грою, здатною працювати на повільній проводці. Чим більше рослинності, тим доцільніше ставити коливалку мінімальної ваги, яка могла б працювати на мінімальних швидкостях підмотки, тобто максимально довго залишатися в полі зору потенційної “жертви”. Вага підбирається виходячи з конкретних умов ловлі, в більшості випадках це 1-3г. Колір відіграє важливу роль і напряму впливає на кількість і якість покльовок. Всім відомі такі “козирні” кольори в джигових приманках як “фіолет”, “карамель”, ”машинне масло” і т.д., коливалки не вийняток і теж мають свої “робочі” кольори.'
      },
      {
        image: 'https://static.pexels.com/photos/235419/pexels-photo-235419.jpeg',
        type: 'Коливалка на головня',
        text: 'Голавль для любого спінінгіста безперечно являється одним з найбажаніших “трофеїв” і на це є декілька причин. По-перше головень справжній “боєць”, завжди атакує приманку з сильним ударом, на виважуванні чинить неймовірний спротив, що в свою чергу дарує нам незабутні враження. Риба надзвичайно обережна і потребує до себе особливих навичок, таких як вміння безшумно підібратися на дальність закидування приманки, бездоганного вміння володіння снастю, адже часто приманку слід посилати в чітко заданий квадрат, де саме знаходиться риба. Така рибалка завжди захоплива і азартна. Успішна ловля передбачає грунтовний підхід, з досконалим вивченням поведінки головня і місць його імовірних стоянок, розуміння, яка має бути приманка і як її подати. При тому, що головень в більшості асоціюється з швидкою річкою і перекатами, водиться він і в озерах, де як правило ще обережніший. Але це швидше виключення з правил для наших умов, тому повернемося до класичного варіанту. Насправді “стрім” це його стихія, в ідеалі з наявністю рослинності як у воді, так і по берегах. Головень риба всеядна, раціон її неймовірно широкий: рослинність, різні комахи, жуки, мальком  і т.п. Звідси і слід починати підбір “уловистої” коливалки. Небезпідставно прийнято вважати, що головень не байдужий до темних кольорів, як і до приманок для яких притаманна високочастотна гра, що десь може нагадувати прямо чи віддалено обєкти його харчування. Звичайно існують вийнятки і тільки практика дозволить наглядно відповісти на всі запитання. Вага коливалок найчастіше в межах 1-3г. Проводка базова рівномірна (коли в приманки стабільна і високочастотна гра), осипання приманки на паузі, відразу після приземлення на воду ( ловля на т.з.”хлюпок” ), ефективна ривкова проводка при роботі з мінімальної ваги приманками ( імітація жучків ).'
      }
    ];

    return (
      <section className="about">

        {/* about us*/}
        <div className="about__us">
          <div className="content">
            <p className="about__us-text">
              Зв'яжіться з нами для отримання більш докладної інформації про наші продукти та послуги.
              <br /> 
              Ми допоможемо вам вибрати потрібний продукт, дамо рекомендації і варіанти доставки. 
              <br />
              Ви можете зв'язатися з нами в будні з 9:00 до 17:00
            </p>
          </div>
        </div>

        {/* about delivery*/}
        <div className="about__delivery">
          {
            delivery.map(el => <div className="delivery-item">
              <h2 className="delivery-item__title heading-2">
                {el.title}
              </h2>
              <p className="delivery-item__text">
                {el.text}
              </p>
            </div>)
          }
        </div>

        {/* about baits*/}
        <div className="about__bait-types">
          {
            baitTypes.map( (el, index) => <div className={`bait-types-item bait-types-item-${index}` + (index%2 ? ' bait-types-item--reversed':'')}>
              <div className="bait-types-item__image-wrapper" style={{backgroundImage: `url(${el.image})`}}>
                <div className="bait-types-item__content">
                  <h1 className="bait-types-item__title heading-2">
                    {el.type}
                  </h1>
                  <p className="bait-types-item__text">
                    {el.text}
                  </p>
                </div>
              </div>
              
            </div>)
          }
          
        </div>
      </section>
    );
  }
}

export default About;